{"keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "resnet50", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_pad", "config": {"trainable": true, "name": "conv1_pad", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "name": "conv1", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1", "filters": 64, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [7, 7], "strides": [2, 2], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn_conv1", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn_conv1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [3, 3], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2a_branch2a", "filters": 64, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "name": "bn2a_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2a_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "res2a_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2a_branch2b", "filters": 64, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "name": "bn2a_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2a_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "res2a_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2a_branch2c", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "res2a_branch1", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2a_branch1", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "name": "bn2a_branch2c", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2a_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "name": "bn2a_branch1", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2a_branch1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "class_name": "Add"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "res2b_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2b_branch2a", "filters": 64, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "name": "bn2b_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2b_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "res2b_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2b_branch2b", "filters": 64, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "name": "bn2b_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2b_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "res2b_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2b_branch2c", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "name": "bn2b_branch2c", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2b_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "class_name": "Add"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "res2c_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2c_branch2a", "filters": 64, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "name": "bn2c_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2c_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "res2c_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2c_branch2b", "filters": 64, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "name": "bn2c_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2c_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "res2c_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res2c_branch2c", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "name": "bn2c_branch2c", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn2c_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "class_name": "Add"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3a_branch2a", "filters": 128, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "name": "bn3a_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3a_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "name": "activation_11", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "res3a_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3a_branch2b", "filters": 128, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "name": "bn3a_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3a_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "name": "activation_12", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "res3a_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3a_branch2c", "filters": 512, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch1", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3a_branch1", "filters": 512, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "name": "bn3a_branch2c", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3a_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "name": "bn3a_branch1", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3a_branch1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "class_name": "Add"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_13", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "res3b_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3b_branch2a", "filters": 128, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "name": "bn3b_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3b_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "name": "activation_14", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "res3b_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3b_branch2b", "filters": 128, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "name": "bn3b_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3b_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "name": "activation_15", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "res3b_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3b_branch2c", "filters": 512, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "name": "bn3b_branch2c", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3b_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "class_name": "Add"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_16", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "res3c_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3c_branch2a", "filters": 128, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "name": "bn3c_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3c_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "name": "activation_17", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "res3c_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3c_branch2b", "filters": 128, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "name": "bn3c_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3c_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "name": "activation_18", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "res3c_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3c_branch2c", "filters": 512, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "name": "bn3c_branch2c", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3c_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "class_name": "Add"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_19", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "res3d_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3d_branch2a", "filters": 128, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "name": "bn3d_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3d_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "name": "activation_20", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "res3d_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3d_branch2b", "filters": 128, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "name": "bn3d_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3d_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "name": "activation_21", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "res3d_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res3d_branch2c", "filters": 512, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "name": "bn3d_branch2c", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn3d_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "class_name": "Add"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_22", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4a_branch2a", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "name": "bn4a_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn4a_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "name": "activation_23", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "res4a_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4a_branch2b", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "name": "bn4a_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn4a_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "name": "activation_24", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "res4a_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4a_branch2c", "filters": 1024, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch1", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4a_branch1", "filters": 1024, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [2, 2], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "name": "bn4a_branch2c", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn4a_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "name": "bn4a_branch1", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn4a_branch1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "name": "add_8", "config": {"trainable": true, "name": "add_8"}, "class_name": "Add"}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_25", "config": {"trainable": true, "name": "activation_25", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "res4b_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4b_branch2a", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "name": "bn4b_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn4b_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "name": "activation_26", "config": {"trainable": true, "name": "activation_26", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "res4b_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4b_branch2b", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "name": "bn4b_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn4b_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "name": "activation_27", "config": {"trainable": true, "name": "activation_27", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "res4b_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4b_branch2c", "filters": 1024, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "name": "bn4b_branch2c", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn4b_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "name": "add_9", "config": {"trainable": true, "name": "add_9"}, "class_name": "Add"}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_28", "config": {"trainable": true, "name": "activation_28", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "res4c_branch2a", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4c_branch2a", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "name": "bn4c_branch2a", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn4c_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "name": "activation_29", "config": {"trainable": true, "name": "activation_29", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "res4c_branch2b", "config": {"trainable": true, "bias_regularizer": null, "padding": "same", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "res4c_branch2b", "filters": 256, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "name": "bn4c_branch2b", "config": {"trainable": true, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "bn4c_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "axis": 3, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "scale": true}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "name": "activation_30", "config": {"trainable": true, "name": "activation_30", "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_30", 0, 0, {}]]], "name": "res4c_branch2c", "config": {"trainable": true, "bias_regularizer": null, "padding": "valid", 